Repository: markus-ro/thesis-artifacts
Catalog: code/fpm/lang/*.po
Languages: german

# language
source: English
german: Deutsch

# save_btn
source: Save
german: Speichern

# cancel_btn
source: Cancel
german: Abbrechen

# continue_btn
source: Continue
german: Fortfahren

# delete_btn
source: Delete
german: Löschen

# create_btn
source: Create
german: Erstellen

# enroll_btn
source: Enroll
german: Registrieren

# reset_btn
source: Reset
german: Zurücksetzen

# generate_pw_button
source: Generate Password
german: Generiere Passwort

# username_field
source: Username
german: Nutzername

# password_field
source: Password
german: Passwort

# old_key_field
source: Old Key
german: Alter Schlüssel

# new_key_field
source: New Key
german: Neuer Schlüssel

# repeat_new_key_field
source: Repeat new Key
german: Bitte neuen Schlüssel wiederholen

# home_nav
source: Home
german: Start

# settings_nav
source: Settings
german: Einstellungen

# save_ab
source: Save
german: Speichern

# lock_ab
source: Lock
german: Sperren

# disconnect_ab
source: Disconnect
german: Schließen

# add_ab
source: Add
german: Hinzufügen

# saved_database_snack
source: Saved Database
german: Datenbank gespeichert

source: Path to Database
german: Pfad zur Datenbank

source: Secret Key
german: Geheimer Schlüssel

# open_btn
source: Open
german: Öffnen

# no_database_path_snack
source: Please enter path to database
german: Bitte geben Sie eine Datenbank an

# no_fpw_file_snack
source: Path does not point to .fpw file
german: Angegebener Pfad zeigt nicht auf .fpw Datei

# enter_key_snack
source: Please enter a key
german: Bitte Schlüssel eingeben

# wrong_data_snack
source: Something is off with the data you entered
german: Etwas stimmt mit Ihren Daten nicht

# file_connected_state_snack
source: Can not set file in connected state
german: Kann Datenbank nicht ändern

# copy_empty_snack
source: Did not copy empty
german: Leer kann nicht kopiert werden

# copy_clipboard_snack
source: Copied to Clipboard
german: In Zwischenablage kopiert

# copy_username_sheet
source: Copy Username
german: Nutzernamen kopieren

# copy_password_sheet
source: Copy Password
german: Passwort kopieren

# edit_entry_sheet
source: Edit Entry
german: Eintrag bearbeiten

# delete_entry_sheet
source: Delete Entry
german: Eintrag löschen

# general_category
source: [b]General[/b]
german: [b]Allgemein[/b]

# dark_theme
source: Enable Dark Theme
german: Dark Theme einschalten

# logging
source: Enable Logging
german: Aktiviere Protokoll

# file_logging
source: Log EEG Data
german: Aktiviere Protokollieren von EEG-Signalen

source: Device Connection
german: Geräte Verbindung

source: Change Database Key
german: Geheimen Schlüssel ändern

# browser_support
source: Enable Browser Support
german: Browser Unterstützung aktivieren

# plugin_auth
source: Enable KeyWave in Browser
german: Authentifizierung für Plugin

# continuous_auth
source: Enable Continuous Authentication
german: Kontinuierliche Authentifizierung aktivieren

# bci_auth_category
source: [b]KeyWave[/b]
german: KeyWave

# configure_bci_auth
source: Configure KeyWave
german: Konfiguriere KeyWave

# restart_snack
source: Please restart application
german: Bitte Anwendung neu starten

# delete_text_diag
source: Do you really want to delete item?
german: Eintrag wirklich löschen?

# edit_entry_diag
source: Edit Entry
german: Eintrag bearbeiten

# new_entry_diag
source: New Entry
german: Eintrag hinzufügen

# change_key_diag
source: Change Database Key
german: Datenbank Schlüssel ändern

# no_database_connected_snack
source: No database connected
german: Keine Datenbank verbunden

# incorrect_key_snack
source: Please enter the correct key
german: Bitte richtigen Schlüssel eingeben

# fill_in_fields_snack
source: Please fill in all fields
german: Bitte alle Felder ausfüllen

# keys_no_match_snack
source: New keys do not match
german: Neue Schlüssel stimmen nicht überein

# browser_support_diag
source: Activate Browser Support
german: Browser-Unterstützung aktivieren

# browser_support_warning
source: Enabling this option allows for the usage of the companion browser plugin. This comes at the risk of exposing stored credentials. Please only use this setting in a controlled network environment.
german: Das aktivieren dieser Funktion erlaubt es, sich per Browser Plugin anzumelden. Dies kann potenziell gespeicherte Daten für Fremde einsehbar machen. Diese Einstellung sollte nur in kontrollierten Netzwerken gewählt werden.

# enrollment_diag_info
source: To use this function, please perform the enrollment procedure. In the procedure you have to silently count the number of times, the image below appears. The whole enrollment takes around one minute.
german: Sie müssen sich registrieren, um diese Funktion nutzen zu können. Bei der Registrierung müssen sie hierzu leise mitzählen, wie oft das unten angezeigte Bild in einer Reihe von Bildern vorkommt. Die Registrierung dauert eine Minute.

# enrollment_diag_fail
source: Enrollment is impossible, as there is no EEG capable device connected!
german: Registrierung ist nicht möglich, da kein EEG-Gerät verbunden ist!
